In [1]:
import pandas as pd
import numpy as np

- Alpha Numeric:
                 
                - Can't perform mathematical operations
                - Ex: Roll No.
- Numeric:  

                - Can perform mathematical operations
                - Ex: Marks

###

### DATA WRANGLING / DATA MUNGING

- Getting valuables insights from the data

- Cleaning is a part of it

#### Imp Keyword used:

        1. dataframe.isnull()  -  Gives a bool value that tells if the value is null or not
                                  if value is null - True
                                  else false

        2. sum()  -  Gives the sum of the assigned value

In [2]:
df = pd.DataFrame( {
                    "Roll No.":[1001, 1002, np.nan, 1003],
                    "Name" : ['X', 'Y', 'Z', np.nan],
                    "Marks": [123, np.nan, 150, 153]
} )

In [3]:
new = df.to_csv("new_data.csv")

In [4]:
df = pd.read_csv("new_data.csv", index_col = 0)
df

   Roll No. Name  Marks
0    1001.0    X  123.0
1    1002.0    Y    NaN
2       NaN    Z  150.0
3    1003.0  NaN  153.0

In [5]:
df.isnull()

   Roll No.   Name  Marks
0     False  False  False
1     False  False   True
2      True  False  False
3     False   True  False

In [6]:
df.isnull().sum()

Roll No.    1
Name        1
Marks       1
dtype: int64

In [7]:
df.iloc[1]

Roll No.    1002.0
Name             Y
Marks          NaN
Name: 1, dtype: object

In [8]:
df.loc[1]

Roll No.    1002.0
Name             Y
Marks          NaN
Name: 1, dtype: object

###

- Mean is calculated only of all non-null values
- In the above dataset, mean marks will be calculated as sum of non-null values divided by 3 because out of 4, only 3 non null values are present

In [9]:
df["Marks"].mean()

142.0

###

- If we can't analyse a specific data, we'll remove it from the dataset

                - dataframe.dropna()  -  GIVES A NEW DATAFRAME AFTER DROPPING ALL THE NULL ROWS; ORIGINAL DATAFRAME IS NOT CHANGED

                - inplace = True  -  This will no make a new dataset and change the original dataset

                - thresh = value  -  Gives a minimum limit for the rows with NULL value to be deleted; value refers to the number of NULL values in the row

                - how = 'all'  -  Deletes all the rows with all NULL values

                - how = 'any'  -  Deletes all the rows with any NULL values; DEFAULT ARGUMENT OF dropna()

                - subset = '[column1, column2...]'  -  Applies dropna function to the specified columns in the list

In [10]:
new_df = df.dropna()
new_df
# df.dropna(inplace=True)
# df

   Roll No. Name  Marks
0    1001.0    X  123.0

In [11]:
df

   Roll No. Name  Marks
0    1001.0    X  123.0
1    1002.0    Y    NaN
2       NaN    Z  150.0
3    1003.0  NaN  153.0

In [12]:
df.dropna(thresh = 0)

   Roll No. Name  Marks
0    1001.0    X  123.0
1    1002.0    Y    NaN
2       NaN    Z  150.0
3    1003.0  NaN  153.0

In [13]:
df.dropna(how='all')

   Roll No. Name  Marks
0    1001.0    X  123.0
1    1002.0    Y    NaN
2       NaN    Z  150.0
3    1003.0  NaN  153.0

In [14]:
li = ['Name', 'Marks']
df.dropna(subset=li)

   Roll No. Name  Marks
0    1001.0    X  123.0
2       NaN    Z  150.0

In [15]:
print(any(df['Marks'].isnull()))
print(all(df['Marks'].isnull()))

True
False

###

#### Preferred way of dealing with NULL values:  DROPPING (FOR BIG DATASET)

#### Non preferred way of dealing with NULL values:  FILLING (FOR SMALL DATASET)

- fillna(value)  -  Gives assigned value to the NULL values

- axis = 'columns'  -  Works on columns; is rows by default

- forward fill (method = "ffill")  -  Fills the nan values as the same value in the last row

- backward fill (method = "bill")  -  Fills the nan values as the same value in the next row

- Interpolate  -  replace the nan by the mean of previous and next value

In [16]:
df.fillna(99, axis = 'columns')

  Roll No.  Name  Marks
0   1001.0     X  123.0
1   1002.0     Y     99
2       99     Z  150.0
3   1003.0  99.0  153.0

In [17]:
df['Marks'].fillna(df['Marks'].mean())

0    123.0
1    142.0
2    150.0
3    153.0
Name: Marks, dtype: float64

In [18]:
df.fillna(method='ffill')

   Roll No. Name  Marks
0    1001.0    X  123.0
1    1002.0    Y  123.0
2    1002.0    Z  150.0
3    1003.0    Z  153.0

In [20]:
df.fillna(method='bfill')

   Roll No. Name  Marks
0    1001.0    X  123.0
1    1002.0    Y  150.0
2    1003.0    Z  150.0
3    1003.0  NaN  153.0

In [22]:
df.interpolate()

   Roll No. Name  Marks
0    1001.0    X  123.0
1    1002.0    Y  136.5
2    1002.5    Z  150.0
3    1003.0  NaN  153.0

In [27]:
df.fillna(np.inf)

   Roll No. Name  Marks
0    1001.0    X  123.0
1    1002.0    Y    inf
2       inf    Z  150.0
3    1003.0  inf  153.0

###

- Nat  -  NULL for date column